/* Класс для массивов переменных */
class AnesthVariables {

    // Данные касающиеся пациента
    static patient = {
        yesNo: ["нет", "да", "неизвестно"],
        bloodGroup: ["O (I)", "A (II)", "A2 (II)", "B (III)", "AB (IV)", "A2B (IV)", "не известна"],
        bloodRh: ["+ (положительный)", "- (отрицательный)", "не известен"],
        stateTypes: ["удовлетворительное", "средней степени тяжести", "тяжелое", "крайне тяжелое", "терминальное"],
        veinsCondition: ["нет признаков варикоза", "есть признаки варикоза", "есть признаки тромбофлебита"],
        stateCons: ["ясное", "сопор", "оглушение", "кома 1", "кома 2", "кома 3"],
        stateCogn: ["сохранны", "снижены", "энцефалопатия", "выраженная энцефалопатия"],
        stateSkin: ["обычной окраски", "бледные", "цианотичные", "диффузный цианоз"],
        stateEdema: ["нет", "нижних конечностей", "верхних конечностей", "ацит", "анасарка"],
        heartTonesRhytm: ["ритмичные,", "аритмичные,", "не определяются"],
        heartTonesState: ["ясные", "приглушены", "глухие", ""],
        stateAuscultation1: ["везикулярное", "жестковатое", "жесткое", "не выслушивается"],
        stateAuscultation2: ["проводится билатерально", "ослаблено в базальных отделах", "ослаблено слева", "ослаблено справа", "резко ослаблено", "не проводится"],
        stateAbdomenPalpation1: ["мягкий,", "позвздут,", "вздут,", "напряжен,", "доскообразный,"],
        stateAbdomenPalpation2: ["безболезненный при пальпации", "умеренно болезненный пальпаторно", "резко болезненный пальпаторно", "не реагирует на пальпацию"],
        stateUrination: ["не затруднено", "затруднено", "по катетеру", "отсутствует"],
        anesthRisk:
            [
                "I",
                "II",
                "III",
                "IV",
                "V",
                "I E",
                "II E",
                "III E",
                "IV E",
                "V E"
            ],
        anesthMallampati:
            [
                "Mallampati class I",
                "Mallampati class II",
                "Mallampati class III",
                "Mallampati class IV"
            ]
    }

    // Вены    
    static ven = [
        "v. jugularis interna dextra",
        "v. jugularis interna sinistra",
        "v. subclavia dextra",
        "v. subclavia sinistra",
        "v. femoralils dextra",
        "v. femoralils sinistra"
    ];

    // Артерии   
    static art = [
        "a. radialis dextra",
        "a. radialis sinistra",
        "a. ulnaris dextra",
        "a. ulnaris sinistra",
        "a. brachialis dextra",
        "a. brachialis sinistra",
        "a. femoralis dextra",
        "a. femoralis sinistra"

    ];
    // Виды анестезии
    static anesthesia = {

        type: [
            "Внутривенная анестезия + Проводниковая анестезия",
            "Многокомпонентная с ИВЛ",
            "Многокомпонентная с ИВЛ в условиях ЭКК",
            "Многокомпонентная с ИВЛ + Эпидуральная анестезия",
            "Многокомпонентная с ИВЛ + Спинальная анестезия",
            "Многокомпонентная с ИВЛ + Спино-эпидуальная анестезия",
            "Эпидуральная анестезия",
            "Спинальная анестезия",
            "Проводниковая анестезия",
            "Анестезиологический мониторинг"

        ],
        targetVen: [
            "Динамический контроль ЦВД",
            "Необходимостиь инфузионно-трансфузионная терапии",
            "Малая выраженность периферических вен",
            "Необходимость ВЭКС",
            "Необходимость экстркорпоральной гемокоррекции",
            "Установка катетера Сван-Ганца",
            "Замена катетера",
            "Установка интродъюссера"
        ],
        targetArt: [
            "Инвазивного измерения АД",
            "Контроля газов артериальной крови",
            "Инвазивного измерения АД, Контроля газов артериальной крови"

        ]
    }

    static reinfusionMachine = {
        type: [
            "Sorin Xtra,",
            "Sorin Electra,"
        ]

    }

    static nurses = [
        "Иванова И.И.",
        // "Иванова И.И."

    ];

    static docs = [
        "Иванов И.И."

    ];


    /// тест

    myFunction(text) {

        //const result = `<h2>${result}</h2>`;
        const result = text + text;
        //document.write(`<h2>${result}</h2>`);
        return result;
    }
}